In [1]:
import pandas as pd
from pathlib import Path

In [2]:
file = pd.read_csv('input/Python Skill Development Programme Registration FINAL.csv')

In [3]:
type(file)

pandas.core.frame.DataFrame

In [4]:
file.head(5)

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1st,IT,NaN
1,2018/01/12 7:25:38 AM GMT+5:30,Abhay sharma,NaN,NaN,1st,ECE,Java
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1st,CSE,C++
3,2018/01/11 10:01:25 PM GMT+5:30,Abhirup Dey,NaN,NaN,2nd,EE,C
4,2018/01/14 11:40:20 PM GMT+5:30,Abhishek Chatterjee,NaN,NaN,3rd,ECE,C

In [5]:
file['Year'] = file['Year'].apply(lambda y: int(y[0]));

In [6]:
file.head(5)

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1,IT,NaN
1,2018/01/12 7:25:38 AM GMT+5:30,Abhay sharma,NaN,NaN,1,ECE,Java
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1,CSE,C++
3,2018/01/11 10:01:25 PM GMT+5:30,Abhirup Dey,NaN,NaN,2,EE,C
4,2018/01/14 11:40:20 PM GMT+5:30,Abhishek Chatterjee,NaN,NaN,3,ECE,C

In [7]:
depts = ['CSE', 'IT', 'ECE', 'EIE', 'EE', 'ME', 'MCA']
years = 4

In [8]:
output_dfs = [
    [
        (
            f'Year-{i + 1}-{dept}',
            file[(file['Year'] == i+1) & (file['Department'] == dept)]
        )
        for dept in depts
    ]
    for i in range(years)
]

In [9]:
print(output_dfs[0][0][0])
output_dfs[0][0][1].head(5)

Year-1-CSE

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
2,2018/01/16 9:36:30 AM GMT+5:30,Abhinav Jain,NaN,NaN,1,CSE,C++
6,2018/01/12 10:48:03 PM GMT+5:30,Abhishek Singh,NaN,NaN,1,CSE,NaN
16,2018/01/11 9:57:43 PM GMT+5:30,Akash Munshi,NaN,NaN,1,CSE,Python;Java
47,2018/01/11 9:55:51 PM GMT+5:30,Ankit Saha,NaN,NaN,1,CSE,Java;JavaScript;PHP;Arduino
58,2018/01/12 3:35:04 PM GMT+5:30,Archika Nandi,NaN,NaN,1,CSE,C++

In [10]:
print(output_dfs[0][1][0])
output_dfs[0][1][1].head(5)

Year-1-IT

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
0,2018/01/11 9:59:46 PM GMT+5:30,Aayush jha,NaN,NaN,1,IT,NaN
12,2018/01/14 10:50:52 PM GMT+5:30,Adityakash singh,NaN,NaN,1,IT,C
18,2018/01/15 10:41:29 PM GMT+5:30,AKHILBARAN GHOSH,NaN,NaN,1,IT,Java;C;C++
29,2018/01/14 6:10:54 PM GMT+5:30,ANAND KUMAR GUPTA,NaN,NaN,1,IT,C;C++
30,2018/01/17 10:46:32 AM GMT+5:30,Ananya Das,NaN,NaN,1,IT,C;C++

In [11]:
print(output_dfs[1][0][0])
output_dfs[1][0][1].head(5)

Year-2-CSE

,Timestamp,Name,AOT Mail Address,Phone Number,Year,Department,Languages known
14,2018/01/17 6:50:27 PM GMT+5:30,Akash Das,NaN,NaN,2,CSE,C
15,2018/01/14 9:26:30 PM GMT+5:30,AKASH DEY,NaN,NaN,2,CSE,Java;C;C++
19,2018/01/12 6:18:04 PM GMT+5:30,Aman Kumar soni,NaN,NaN,2,CSE,C
22,2018/01/12 2:22:47 PM GMT+5:30,amit kumar mitra,NaN,NaN,2,CSE,C
35,2018/01/15 8:23:16 PM GMT+5:30,Anindya Chatterjee,NaN,NaN,2,CSE,C

In [16]:
total_students = 0
for row in output_dfs:
    for filename, df in row:
        print(f'{" ".join(filename.split("-")[:2])}: {filename.split("-")[2]}\t-> {len(df):3} students')
        total_students += len(df)
#         df.to_csv(Path('pandas-outputs') / f'{filename}.csv')

    print()

print('Total Students:', total_students)

Year 1: CSE	->  30 students
Year 1: IT	->  26 students
Year 1: ECE	->  30 students
Year 1: EIE	->   6 students
Year 1: EE	->  19 students
Year 1: ME	->  25 students
Year 1: MCA	->  16 students

Year 2: CSE	->  54 students
Year 2: IT	->  25 students
Year 2: ECE	->  31 students
Year 2: EIE	->  13 students
Year 2: EE	->  18 students
Year 2: ME	->   8 students
Year 2: MCA	->  11 students

Year 3: CSE	->  30 students
Year 3: IT	->  20 students
Year 3: ECE	->  26 students
Year 3: EIE	->   3 students
Year 3: EE	->   8 students
Year 3: ME	->  38 students
Year 3: MCA	->   2 students

Year 4: CSE	->   5 students
Year 4: IT	->   0 students
Year 4: ECE	->  13 students
Year 4: EIE	->   2 students
Year 4: EE	->   0 students
Year 4: ME	->   0 students
Year 4: MCA	->   0 students

Total Students: 459